app/controllers/buscar_controller.rb

  def show
    @tienda = Tienda.new
    @tiendas = Tienda.find(:all, :conditions => {:ciudad => params[:id]})
---
SELECT * FROM `tiendas` WHERE (`tiendas`.`ciudad` = 'BARQUISIMETO') LIMIT 1