app/controllers/tiendas_controller.rb

SELECT * FROM `tiendas` WHERE (`tiendas`.`id` = '--- :nearest\n')
---
  def index
    @tiendas = Tienda.find(:all)