app/controllers/tiendas_controller.rb

  def index
    @tiendas = Tienda.all
---
SELECT * FROM `tiendas`

  def show
    @tienda = Tienda.find(params[:id])
---
SELECT * FROM `tiendas` WHERE (`tiendas`.`id` = 2053932785)

  def edit
    @tienda = Tienda.find(params[:id])
---
SELECT * FROM `tiendas` WHERE (`tiendas`.`id` = 2053932785)

  def create
    @tienda = Tienda.new(params[:tienda])

    respond_to do |format|
      if @tienda.save
---
INSERT INTO `tiendas` (`created_at`, `nombre`, `updated_at`, `lng`, `ciudad`, `pais`, `estado`, `direccion`, `lat`, `codigo_postal`) VALUES('2009-12-04 21:20:54', 'Acropolis Center', '2009-12-04 21:20:54', -69.9413915, '', 'DO', '', 'Ave. Winston Churchill 1001 Santo Domingo DO', 18.4718678, '')

  def update
    @tienda = Tienda.find(params[:id])

    respond_to do |format|
      if @tienda.update_attributes(params[:tienda])
---
SELECT * FROM `tiendas` WHERE (`tiendas`.`id` = 2053932785)
UPDATE `tiendas` SET `updated_at` = '2009-12-04 20:05:48', `nombre` = '50 Biscayne', `direccion` = '500 biscayne bay miami fl 33132' WHERE `id` = 1

  def destroy
    @tienda = Tienda.find(params[:id])
    @tienda.destroy
---
SELECT * FROM `tiendas` WHERE (`tiendas`.`id` = 2053932785)
DELETE FROM `tiendas` WHERE `id` = 2053932785